In [ ]:
import pandas as pd
csv_path = 'file1.csv'
df = pd.read_csv(csv_path)
df.head()

In [3]:
# What is a Series?
data = [10, 20, 30, 40, 50]
s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
# Accessing Elements in a Series
print(s[2])        # 30, by labels
print(s.iloc[3])   # 40, position 3
print(s[1:4])      # Access a range of elements by lables

30
40
1    20
2    30
3    40
dtype: int64

In [7]:
# Creating a dataframes from Dictionaries
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)

print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [18]:
# Column Selection:
print(df['Name'])      # Access the 'Name' column

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [16]:
print(df.iloc[2])      # Access the third row by position

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [17]:
print(df.loc[1])       # Access the third row

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [ ]:
print(df[['Name', 'Age']])    # Select the specific columns
print(df[1:3])                # Select the specific rows

In [ ]:
# Extracting Unique value or freq.
df['name of column'].unique()

In [ ]:
# Applying inequality operators
df1 = df[df['Released']>1979]

# Save as CSV
ds1.to_csv('new_songs.csv')

#### Exercise 1: Pandas: Dataframe & Series

In [20]:
import pandas as pd
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [22]:
# Retrieving the "ID" column
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [23]:
# Check the type of x
type(x)

pandas.core.frame.DataFrame

In [29]:
# Retrieving the Department, Salary and ID columns and assigning it to a variable z
z = df[['ID','Department','Salary']]
z

   ID       Department  Salary
0   1  Architect Group  100000
1   2   Software Group   80000
2   3      Design Team   50000
3   4   Infrastructure   60000

#### Exercise 2: loc() & iloc()

In [31]:
df.iloc[0,0]

'Rose'

In [32]:
df.iloc[0,2]

'Architect Group'

In [33]:
df.loc[0,'Salary']

100000

In [34]:
df2 = df
df2 = df2.set_index("Name")

In [35]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [36]:
#Now, let us access the column using the name
df2.loc['Jane', 'Salary']

50000

#### Exercise 3: Slicing

In [63]:
print(df)
df.iloc[0:2, 0:3]

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [44]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [45]:
#let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

#### Labs

In [51]:
!pip install xlrd openpyxl

Requirement already satisfied: xlrd in /opt/anaconda3/lib/python3.11/site-packages (2.0.1)
Requirement already satisfied: openpyxl in /opt/anaconda3/lib/python3.11/site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in /opt/anaconda3/lib/python3.11/site-packages (from openpyxl) (1.1.0)

In [ ]:
# Read data from CSV file

# csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv'
# df = pd.read_csv(csv_path)

from pyodide.http import pyfetch
import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv"

async def download(url, filename):
    response = await pyfetch(url)
    if response.status == 200:
        with open(filename, "wb") as f:
            f.write(await response.bytes())


await download(filename, "TopSellingAlbums.csv")
df = pd.read_csv("TopSellingAlbums.csv")